new_js_project_backend/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "review", "rating", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        book = Book.create(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 14]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def destroy
        book=Book.find_by(:id => params[:id]).destroy