new_js_project_backend/app/controllers/users_controller.rb

    def create


        if User.find_by(:name => user_params[:name])
            user = User.find_by(:name => user_params[:name])
            redirect_to "/users/#{user.id}"
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Jenna"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Madden"], ["created_at", "2021-01-08 20:11:10.978036"], ["updated_at", "2021-01-08 20:11:10.978036"]]

    def show
        user = User.find_by(:id => params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]